app/Controllers/Artikel.php

  public function admin_index()
  {
    $title = 'Daftar Artikel';
    $model = new ArtikelModel();
    $data = [
      'title' => $title,
      'artikel' => $model->paginate(10), #data dibatasi 10 record per halaman
---
SELECT *
FROM `artikel`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`

  public function add()
  {
    // validasi data.
    $validation = \Config\Services::validation();
    $validation->setRules(['judul' => 'required']);
    $isDataValid = $validation->withRequest($this->request)->run();
    if ($isDataValid) {
      $artikel = new ArtikelModel();
      $judul = $this->request->getVar('judul');
      $artikel->insert([
        'judul' => $judul,
        'isi' => $this->request->getPost('isi'),
        'slug' => url_title($judul, '-', 'true'),
      ]);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`) VALUES ('Artikel', '', 'artikel')